# Проект FitLife - MVP версия 1.0


# 1. Знакомство
print("Привет, друг! Как я могу тебя называть?")
user_name = input("Введите своё имя: ")   
print("Приятно познакомиться,",user_name, "а сколько тебе лет?")                    
user_age = int(input("Напишите ваш возраст(целое число): "))                                                        # TODO: Спроси возраст и сохрани в переменную user_age (не забудь преобразовать в число)


# 2. Сбор данных
print("Понятно, а сколько ты весишь?")
user_weight = float(input("Напишите ваш вес: "))                                                                                           # TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
print("Ага, а твой рост?")
user_height = float(input("Напишите ваш рост(в метрах): "))                                                                                           # TODO: Запроси рост (в метрах, например 1.75) и сохрани в user_height (тип float)


# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
bmi = user_weight / (user_height ** 2) 
bmi = round(bmi, 1)                                                                                   #TODO: Рассчитай bmi (Индекс массы тела)


# Подсчет воды: вес * 30 мл
water_ml = user_weight * 30                                                                                             # TODO: Рассчитай water_needed
water_l = water_ml / 1000

# 4. Вывод красивого результата
print(f"Ну что, {user_name}, давай подведем итоги")                                                                                     # TODO: Используй f-строку, чтобы вывести приветствие, например: "Привет, Иван!"
print(f"В {user_age} ваш ИМТ равен {bmi}, а норма воды {water_l} литров")                                                                  # TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.
print("Расчет окончен. Будьте здоровы!")
